app/controllers/recipes_controller.rb

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		recipe =  Recipe.find(params[:id])

INSERT INTO "recipes" ("title", "prep_time", "cook_time", "servings", "origin") VALUES (?, ?, ?, ?, ?)  [["title", "Sandweech"], ["prep_time", 932], ["cook_time", 22], ["servings", 2], ["origin", "BD"]]
---
	def create
		recipe = Recipe.new(recipe_params)
		if recipe.save

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def edit
        recipe = Recipe.find(params[:id])

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "recipes" SET "origin" = ? WHERE "recipes"."id" = ?  [["origin", "BM"], ["id", 5]]
---
	def update
        recipe = Recipe.find(params[:id])
		if recipe.update(recipe_params)

DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def destroy
        Recipe.find(params[:id]).destroy